Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཡུལ་སུ་བི་ར་ཞེས་བྱ་བ་ན་ནི་རྒྱལ་པོ་འཆར་ཀ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: and King Udaya reigned in Suvīra.

source: དེ་གཉིས་མཛའ་ཞིང་བཤེས་ལ་གཅུགས་ཏེ་དུས་དུས་སུ་ཕོ་ཉ་དང་སྐྱེས་ཀྱིས་འདྲུལ་ལོ། །
en: The two were dear friends, and from time to time they sent envoys to each other bearing gifts.

source: རྒྱལ་པོ་རབ་སྣང་གི་ཡུལ་ན་ཨ་མྲ་རབ་ཏུ་དཀོན་ཏེ། སུ་བི་རའི་རྒྱལ་པོས་རྒྱལ་པོ་རབ་སྣང་དགའ་བར་བྱ་བའི་ཕྱིར། ཨ་མྲ་མང་པོ་སྐྱེས་སུ་བསྐུར་རོ། །
en: There were hardly any mangoes in King Pradyota’s country, so the king of Suvīra sent gifts of many mangoes to please King Pradyota.

source: དེ་ནས་རྒྱལ་པོ་རབ་སྣང་གིས་ཁ་ཅིག་ནི་བཙུན་མོ་ལ་བྱིན་ནོ། །
en: King Pradyota gave some to the queen,

source: ཁ་ཅིག་ནི་བུ་རྣམས་ལ་བྱིན་ནོ། །
en: some to his sons,

source: ཁ་ཅིག་ནི་བློན་པོ་རྣམས་ལ་བྱིན་ནོ། །
en: and some to his ministers.

source: དེ་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་ཨ་མྲ་ཟོས་ནས་བློ་སྐྱེས་པ།
en: Then King Caṇḍapradyota himself ate some of the mangoes, and the thought came to him,

source: བདག་གི་ཡུལ་འདི་ན་ཨ་མྲ་མེད་ཀྱིས་བདག་གིས་ཨ་མྲའི་ས་བོན་འདི་རྣམས་བདག་གིས་སྐྱེད་མོས་ཚལ་དུ་རྨོའོ་སྙམ་དུ་བསམས་ནས
en: “Here in my country there are no mangoes, so I’ll plant these mango pits in the garden.”

source: དེས་ཨ་མྲའི་ས་བོན་དེ་དག་ཁྱེར་ཏེ། རང་གི་སྐྱེད་མོས་ཚལ་དུ་རྨོས་ནས།
en: He took those mango pits and planted them in his own garden,

source: དེ་དག་རིང་པོ་མ་ཐོགས་པར་སྐྱེས་ཏེ། ཆེར་གྱུར་ནས་རིང་པོ་མ་ཐོགས་པར་ཚལ་ཆེན་པོར་གྱུར་ཏེ་ཡལ་ག་རྣམས་རྒྱས་པར་གྱུར་ཏོ། །
en: and before long the trees grew big, and there was a large grove with mature branches.

source: ཕྱི་ཞིག་ན་དེ་དག་མེ་ཏོག་རྒྱས་ཤིང་འབྲས་བུ་ཆགས་ནས།
en: Later, the trees blossomed and bore fruit,

source: རྒྱལ་པོ་རབ་སྣང་གིས་དེ་དག་གཞན་དག་མི་ཟ་བར་བྱ་བའི་ཕྱིར། གདོལ་པ་རྣམས་ཨ་མྲ་དེ་དག་གི་སྲུངས་མར་བསྐོས་སོ། །
en: and King Pradyota charged some untouchables with protecting the mangoes so they would not be eaten by others.

source: དེ་ནས་ཕྱི་ཞིག་ན་གདོལ་པ་དེ་དག་ཉིད་ཀྱིས་ཨ་མྲ་དེ་རྣམས་ཟོས་ནས་རྐུན་པོ་བྱུང་ཞེས་བསྒྲགས་ཏེ།
en: One day the untouchables ate the mangoes themselves. They shouted, “Thieves!

source: འདི་འདི་དག་ནི་རྐུན་པོས་ཟོས་སོ་ཞེས་ཟེར་ཏོ། །
en: Thieves!” and claimed, “Thieves ate them.”

source: དེ་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་འཕྲིགས་ཏེ། གདོལ་པ་འདི་དག་ཉིད་ཀྱིས་ཨ་མྲ་འདི་དག་ཟོས་གྲང་སྙམ་དུ་བསམས་ནས།
en: King Caṇḍapradyota was suspicious, and thought, “Perhaps the untouchables have eaten the mangoes themselves.”

source: དེས་རྒྱལ་པོའི་ཞབས་འབྲིང་བ་རྣམས་བཏང་སྟེ། གདོལ་པའི་ཁྱིམ་ཚོལ་དུ་བཅུག་པ་ལས།
en: He sent his servants to search the untouchables’ dwellings.

source: དེ་དག་དེར་སོང་བ་དང་ཨ་མྲའི་རུས་པ་དེ་དག་མཐོང་ནས། དེ་ནས་རྒྱལ་པོའི་ཞབས་འབྲིང་བ་རྣམས་ཀྱིས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་ལ་གསོལ་ཏོ། །
en: After they went there and saw remnants of the mangoes, the royal servants informed King Pradyota.

source: དེ་ནས་གཏུམ་པོ་རབ་སྣང་ཁྲོས་པས་གདོལ་པ་འཁོར་དང་བཅས་པ་ཁྱིམ་གྱི་ནང་དུ་བཙུད་དེ། ཁྱིམ་གྱི་ཁོ་ར་ཁོར་ཡུག་ནས་རྩྭ་སྤུངས་ཏེ་མེ་བཏང་ནས་བསྲེགས་སོ། །
en: Then, in a fit of anger, King Caṇḍapradyota corralled all the untouchable families back into their dwellings, heaped up dry grass all around the dwellings, and set fire to it, burning them to the ground.

source: གྲོང་དེའི་ནང་ནས་གདོལ་པའི་ཁྱེའུ་གཅིག་གདོལ་པའི་ལས་ཀྱིས་ངོ་ཚ་ནས་ལྷོ་ཕྱོགས་སུ་སོང་ངོ་། །
en: One of the young untouchables from the village who felt embarrassed about the way the untouchables had acted had already gone south.

source: དེར་སོང་ནས་བྲམ་ཟེའི་ཆ་ལུགས་སུ་ཞུགས་ཏེ་ལུས་མི་སྣང་བར་འགྱུར་བའི་རིག་པ་བསླབས་སོ། །
en: After he left he took on the guise of a brahmin and trained in the science of invisibility.

source: དེས་དེ་བསླབས་ནས། ཕྱིར་གྲོང་ཁྱེར་གྱེན་དུ་རྒྱལ་དུ་ཕྱིར་འོངས་ནས། རང་གི་ཁྱིམ་དུ་སོང་སོང་བ་ལས་དེ་བལྟས་ན་གྲོང་ཐམས་ཅད་མེས་ཚིག་པར་མཐོང་ནས།
en: Having mastered it he later returned to the city of Ujjayinī, where, on the way to his house, he saw that the entire village had burned to the ground.

source: མཐོང་མ་ཐག་ཏུ་གྲོང་འདི་སུས་མ་རུང་བར་བྱས་ཞེས་དྲིས་ན།
en: When he saw this he asked,

source: དེས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་བྱས་སོ་ཞེས་ཐོས་ནས་དེས་སྨྲས་པ།
en: “Who destroyed our village?” and was told, “It was King Caṇḍapradyota.”

source: བདག་གི་ཉེ་དུ་དེ་རྣམས་གར་སོང་།
en: “Where did my family go?” he asked.

source: དེ་དག་གིས་སྨྲས་པ། རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་ཁྲོས་པས་རྩྭ་སྤུངས་པས་བསྐོར་ཏེ་འཁོར་དང་བཅས་པ་མེས་བསྲེགས་སོ་ཞེས་བྱས་སོ། །
en: “In a fit of anger, King Caṇḍapradyota surrounded their houses with heaps of dry grass,” they said, “and he and his servants burned them up in the fire.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱེའུ་དེ་སྡུག་བསྔལ་ཆེན་པོས་ཐེབས་ནས་
en: The young man was devastated when he heard all this.

source: དེས་བསམས་པ། སྐྱེས་པ་རྣམས་ཀྱིས་ནི་དངོས་སུ་ཉེས་པར་བྱས་པས། དེ་དག་ལ་ནི་དེས་ཁྲིམས་བཞིན་དུ་བྱས་ན
en: “In truth it was the men’s fault, and they have been dealt with according to the law,” he thought.

source: བྱིས་པ་དང་བུད་མེད་རྣམས་ཀྱིས་དེ་ལ་ཉེས་པ་ཅི་ཞིག་བྱས་ན་དེ་དག་ཀྱང་མེས་བསྲེགས།
en: “But the children and the women did him no harm at all, and they too were burned up in the fire.

source: ད་ནི་ངས་ཀྱང་དུས་ངན་པའི་རྒྱལ་པོ་དེས་བྱས་པའི་ཤ་གླན་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་
en: I will take revenge on the king of our wicked age.”

source: བདག་ཉིད་མི་སྣང་བར་བྱས་ཏེརྒྱལ་པོའི་ཕོ་བྲང་དུ་སོང་ནས། དེས་རྒྱལ་པོ་ལ་མགོ་ལྕག་གིས་གཞུས་ཏེ།
en: He made himself invisible, entered the royal palace, and struck the king on the head with a whip.

source: དུས་ངན་པའི་རྒྱལ་པོ་ཁྱོད་ལ་གདོལ་པ་དེ་དག་གིས་ཉེས་པ་ཅི་བྱས།
en: “King of our wicked age!” he said. “What harm did the untouchables ever do to you?”

source: རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་སྨྲས་པ། དེ་དག་གིས་ངའི་ཨ་མྲ་རྣམས་མེད་པར་བྱས་སོ། །
en: “They stole my mangoes!” replied King Caṇḍapradyota.

source: གདོལ་པའི་ཁྱེའུས་སྨྲས་པ། གལ་ཏེ་སྐྱེས་པ་རྣམས་ཀྱིས་ཉེས་སུ་ཟིན་ཀྱང་བུད་མེད་དང་ཁྱེའུ་དང་བུ་མོ་རྣམས་ཀྱིས་ཉེས་པ་ཅི་བྱས།
en: “The men were to blame,” said the young untouchable, “but what did their wives and children do wrong?

source: ད་ནི་རྒྱལ་པོ་འཆལ་བ་ཁྱོད་བྱ་བ་ཅི་ཡོད་པ་དང་དོན་ཅི་ཡོད་པ་དེ་བྱོས་ཤིག །
en: Put your affairs in order, vile king.

source: ཁྱོད་གསོན་པའི་དུས་ཟད་དེ་ཞག་བདུན་ན་འཆི་དགོས་སོ་ཞེས་བྱས་ནས།
en: Your life is at its end, for in seven days you must die!”

source: གདོལ་པའི་ཁྱེའུ་དེ་ཉིན་གཅིག་བཞིན་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འགྲོ་སྟེ་རྒྱལ་པོ་ལ་རྡེག་ཅིང་འདི་སྐད་དུ།
en: Every day after that the young untouchable went to the royal palace to beat the king and to say,

source: ཆེ་གེ་མོའི་ཉིན་པར་ཁྱོད་མེད་པར་བྱའོ་ཞེས་ཀྱང་ཟེར་རོ། །
en: “On such-and-such a date you will be no more!”

source: དེ་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་འཇིགས་ཤིང་སྐྲག་ནས། བློན་པོ་རྣམས་ཀྱིས་གསོལ་པ།
en: King Caṇḍapradyota was terrified, and his ministers entreated him,

source: ལྷ་མི་བསྙེངས་སུ་གསོལ།
en: “Deva, don’t be afraid.

source: བདག་ཅག་གིས་འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ན་ལ་གསོལ་པ་གདབ་བོ་ཞེས་སྨྲས་ནས།
en: We will make supplications to Noble Kātyāyana.”

source: བློན་པོ་རྣམས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: The ministers approached Venerable Kātyāyana and implored him,

source: འཕགས་པ་རྒྱལ་པོ་ལ་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་གནོད་པ་བགྱིད་ན་དེའི་སྐྱབས་མཛད་པར་གསོལ་ཞེས་བྱས་སོ། །
en: “Noble one, disembodied spirits are doing harm to the king. We ask you, please protect him!”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ནས། གདོལ་པའི་ཁྱེའུ་དེའི་རིག་སྔགས་དེ་ཅི་ནས་ཕྱིན་ཆད་མི་སྣང་བར་བྱེད་མི་ནུས་པར་བྱས་སོ། །
en: As soon as Noble Kātyāyana heard this, he counteracted the young untouchable’s secret mantra so that he could never become invisible again.

source: བདག་གི་རིག་སྔགས་སུ་ཞིག་གིས་མ་རུང་བར་བྱས་ཞིག་གུ་སྙམ་ནས།
en: “Who destroyed my mantra?”

source: བློན་པོ་དེ་རྣམས་ལ་དྲིས་པ།
en: and he asked the ministers,

source: ཀྱེ་རྒྱལ་པོ་མི་མ་ཡིན་པའི་འཇིགས་པ་དེ་ལས་སུ་ཞིག་གིས་སྐྱབས་བྱས་བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “Tell me, who protected the king from fear of disembodied spirits?”

source: འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ནས་བྱས་སོ། །
en: “Kātyāyana did, noble one,” the ministers replied.

source: དེ་ནས་ཐོས་མ་ཐག་ཏུ་གདོལ་པའི་ཁྱེའུ་དེ། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ན་ག་ལ་བ་དེར་སོང་ནས་སྨྲས་པ།
en: When he heard this, the young untouchable immediately went to see Venerable Kātyāyana and asked,

source: བཙུན་པ་ཁྱོད་ཀྱིས་ཅིའི་སླད་དུ་བདག་གིས་རིག་སྔགས་རེངས་པར་མཛད།
en: “Lord, why did you neutralize my mantra?”

source: ཀཱ་ཏྱཱ་ཡ་ནས་སྨྲས་པ། བུ་འདུག་ཤིག་དང་ཁྱོད་ལ་རྒྱས་པར་བསྙད་པར་བྱའོ། །
en: “Sit down child,” Kātyāyana replied, “and I shall tell you in detail.”

source: དེ་ནས་གདོལ་པའི་ཁྱེའུ་དེས། འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་གོ། །
en: The young untouchable bowed down at Noble Kātyāyana’s feet and sat before him,

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནས། དེ་ལ་མཐར་གྱིས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: and Venerable Kātyāyana taught him the Dharma in a gradual way, in a manner agreeable to him.

source: དེས་ན་གདོལ་པའི་ཁྱེའུ་དེས་སྟན་དེ་ཁོ་ན་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When he heard it the young untouchable destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ན་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: After seeing the truths, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward Venerable Kātyāyana with palms pressed together, and requested,

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནས་དེ་རབ་ཏུ་བྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Venerable Kātyāyana led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེ་ནས་བློན་པོ་དེ་དག་གིས་ཐོས་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་ལ་གསོལ་པ།
en: When the ministers heard this, they told King Caṇḍapradyota,

source: ལྷ་ཁྱོད་གང་གིས་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་པ་དེ་ནི་འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ནས་རབ་ཏུ་ཕྱུང་ལགས་སོ། །
en: “Deva, Noble Kātyāyana has led the one who terrified you so to go forth.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་ཡིད་དགའ་བར་གྱུར་ནསཀཱ་ཏྱཱ་ཡ་ན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: As soon as he heard this, the king joyfully went to see Noble Kātyāyana, bowed down at his feet, and said,

source: འཕགས་པ་ནི་བདག་ལ་དཀའ་བ་མཛད་པ་དང་། སྲོག་ཕངས་པ་སྩོལ་བ་ལགས་ཀྱིས།
en: “Noble one, you undertook the difficult task of saving my precious life.

source: དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བདག་གི་ཁྱིམ་དུ་དགུང་བདུན་བཤོས་གསོལ་བར་ཅི་གནང་།
en: Please permit me to invite you, together with the saṅgha of monks, to take your meals at my house for seven days.”

source: ཀཱ་ཏྱཱ་ཡ་ནས་སྨྲས་པ། ལྷ་གྱེན་དུ་རྒྱལ་འདི་ཉིད་ན་བཅོམ་ལྡན་འདས་བཞུགས་ཀྱིས།
en: “Deva,” Kātyāyana said, “the Blessed One is staying right here in Ujjayinī.

source: བཅོམ་ལྡན་འདས་སྤྱན་དྲོངས་ཤིག་ཅེས་བྱས་སོ། །
en: Therefore, you should invite the Blessed One instead.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: No sooner had he heard this than the king went to see the Blessed One, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: The Blessed One instructed, encouraged, inspired, and delighted him with a discourse on the Dharma, and then sat in silence.

source: དེ་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་མཇུག་རྫོགས་པར་རིག་ནས། སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Knowing that the Blessed One had completed his discourse, King Caṇḍapradyota rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and asked the Blessed One,

source: འཕགས་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་སླད་དུ། དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བདག་གི་ཁྱིམ་དུ་དགུང་བདུན་བཤོས་གསོལ་བར་ཅི་གནང་།
en: “Out of solicitude for Noble Kātyāyana, please permit me to invite you, together with the saṅgha of monks, to take your meals at my house for seven days.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to King Caṇḍapradyota by his silence.

source: དེ་ནས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: Understanding that by his silence the Blessed One had given his assent, King Caṇḍapradyota then praised this assurance from the Blessed One, rejoiced, touched his head to the Blessed One’s feet, and took leave of him.

source: དེ་ནས་དེས་ཕོ་བྲང་གི་ནང་དུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཞག་བདུན་གྱི་བར་དུ་བཤོས་གསོལ་ནས།
en: After he had offered food to the Buddha and the rest of the saṅgha of monks for seven days inside the palace,

source: ཐ་མའི་ཉིན་པར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ། ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་གསོལ་ནས། བཅོམ་ལྡན་འདས་ལ་ན་བཟའ་འབུམ་རི་བ་ཕུལ་ལོ། །
en: on the last day he offered food of a hundred flavors to the Buddha and the rest of the saṅgha of monks and to the Blessed One he offered a very costly robe.

source: དགེ་སློང་གཞན་རྣམས་ལ་ནི་རེ་རེ་ལ་རས་བཅོས་བུ་ཟུང་རེ་ཕུལ་ལོ། །
en: He offered a set of robes fashioned from cotton to each of the other monks,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན་ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད་ཡང་དག་པར་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: and after the Blessed One had instructed, encouraged, inspired, and delighted him with a discourse on the Dharma, he rose from his seat and departed.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་གདོལ་པའི་ཁྱེའུ་འདིས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: “Lord,” the monks inquired of the Blessed One, “what action did the young untouchable take that ripened such that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Buddha, cast away all afflictive emotions, and manifested arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་འདི་བྱས་ཤིང་བསགས་ཏེ
en: “Monks,” the Blessed One explained, “such are the actions that he committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། འདི་ནས་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་པ་ན་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in the ninety-first eon, when people lived as long as eighty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Vipaśyin was in the world,

source: དེ་གང་གི་ཚེ་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས། ཤིང་ཟད་པའི་མེ་བཞིན་དུ་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: he performed all the activities of a buddha and passed beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates, like a fire when all the wood is gone.

source: དེ་ནས་རྒྱལ་པོ་མཉན་ཡོད་ཀྱིས་ས་ཕྱོགས་གོ་སྐབས་ཡངས་པ་ཞིག་ཏུ་འབྱོར་པ་ཆེན་པོ་དང་ལྡན་པས། སྤོས་ཀྱི་ཤིང་རྣམས་སྤུངས་ནས་དེའི་རིང་བསྲེལ་ཞུགས་ལ་བཞེན་ཏོ། །
en: “King Bandhumat used his great fortune to heap up fragrant wood in a wide open space and burned all of Buddha Vipaśyin’s remains in a fire.

source: དེ་ནས་དེའི་སྐུ་གདུང་རྣམས་གཞན་གྱིས་མི་ཁྱེར་བར་བྱ་བའི་ཕྱིར། སྐུ་གདུང་བཞུགས་པ་དེ་ནས་ཐག་མི་རིང་བ་ཞིག་ན་གདོལ་པ་དག་ཅིག་སྲུངས་མར་བསྐོས་ཏེ།
en: Then he interred the relics so that others would not remove them, and charged a nearby group of untouchables with protecting them.

source: གདོལ་པ་དེ་དག་ས་ཕྱོགས་དེར་ཉལ་བ་ལས་གདོལ་པ་ཞིག་སྟག་གིས་ཁྱེར་ནས།
en: One night, as the untouchables were sleeping there, a tiger in the area carried one of them off.

source: གདོལ་པ་གཞན་ཞིག་འཇིགས་ཤིང་སྐྲག་སྟེ།
en: One of the others cried out in terror,

source: སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བརྗོད་ནས། དེ་སངས་རྒྱས་ཀྱི་མཐུས་ལྷ་རྣམས་ཀྱིས་སྐྱབས་བྱས་སོ། །
en: ‘I bow down to the Buddha!’ and by the power of the Buddha, the gods protected him.

source: དེ་ནས་གང་གི་ཚེ་དེར་རྒྱལ་པོ་མཉན་ཡོད་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཀྱི་སྐུ་གདུང་གི་མཆོད་རྟེན་བརྩིགས་ཏེ།
en: “Then King Bandhumat built a stūpa for the relics of the totally and completely awakened Buddha Vipaśyin.

source: རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། དུས་སྟོན་གྱི་ལུགས་སུ་གཏོད་པ་དེའི་ཚེ་གདོལ་པ་དེའི་བློ་སྐྱེས་པ།
en: When it was complete in every respect and the time came to celebrate its traditional festival, the thought occurred to that untouchable,

source: བདག་གསོན་པོར་གྱུར་པ་ནི་ཅི་ཡང་རུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་མཐུ་ཡིན་ནོ་སྙམ་དུ་རིག་ནས།
en: ‘It is by the power of the Blessed Buddha that I am alive at all.’

source: དེས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་ཆེན་པོ་བྱས་ཏེ་སྨོན་ལམ་བཏབ་པ།
en: Knowing this, he made a large offering to the stūpa and prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། འདི་ཁོ་ན་དང་འདྲ་བའི་སྟོན་པ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘By this root of virtue, may I please and not displease a teacher just like this one.

source: དེའི་ཚེ་གདོལ་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གདོལ་པའི་ཁྱེའུ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that young untouchable then is none other than this young untouchable.

source: དེས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པ་དེས་ན།
en: At that time he venerated the stūpa and made those prayers.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་དང་། ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Vipaśyin—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: “Later, he also went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དགེ་སློང་འཐབ་ཀྲོལ་ཅན་ཁ་མི་མཁས་པ་ཞིག་ཏུ་གྱུར་ནས།
en: Quarrelsome as a monk, he became a scholar.

source: དེས་དེར་དགེ་སློང་མང་པོ་དག་ལ་ཁྲོས་ཏེ། གདོལ་པ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་ནས་
en: At that time out of anger he called a group of monks untouchables.

source: ཕྱི་ཞིག་ན་དེ་འགྱོད་པ་སྐྱེས་ཏེ། དེས་དགེ་སློང་དེ་དག་ལ་བཟོད་པ་གསོལ་ནས།
en: One day he felt regret, asked forgiveness of the monks,

source: ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་སྟེ་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: and practiced the conduct leading to liberation all his life. While he may not have attained any great virtues, at the time of his death, he prayed,

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་གང་ཡིན་པ་དེ་ནི་གདོལ་པའི་ཁྱེའུ་འདི་ཁོ་ན་ཡིན་ཏེ
en: The monk who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa then is none other than this untouchable.

source: དེས་དེར་དགེ་སློང་མང་པོ་ལ་གདོལ་པ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། ཚེ་རབས་ལྔ་བརྒྱར་གདོལ་པའི་རིགས་སུ་སྐྱེས་སོ། །
en: At that time the act of calling a group of monks untouchables ripened such that for five hundred lifetimes he took rebirth as a untouchable.

source: དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: He also practiced pure conduct all his life, and at the time of his death, he prayed,

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: རབ་བཟང་ཞེས་བྱ་བ་ནི།
en: The Story of Subhadra the Charioteer

source: རྒྱལ་པོ་ཟས་གཙང་གི་ཁ་ལོ་པ་རབ་བཟང་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ། དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས།
en: King Śuddhodana had a certain charioteer named Subhadra. When the time came for him to marry, he took a wife.

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་ཀྱང་དེ་ལ་བུ་མེད་དེ།
en: But even though they enjoyed themselves and coupled, they had no children.

source: བུ་འདོད་པའི་ཕྱིར་ལྷ་གུ་ལང་དང་། ཆུ་ལྷ་དང་། ཀུ་བེ་ར་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་དང་། ཀུན་དགའ་ར་བའི་ལྷ་དང་། ནགས་ཚལ་གྱི་ལྷ་དང་། ལམ་གྱི་བཞི་མདོའི་ལྷ་དང་། སུམ་མདོའི་ལྷ་དང་། གཏོར་མ་ལེན་པའི་ལྷ་དང་། ལྷན་ཅིག་སྐྱེས་པ་དང་། ཆོས་འཐུན་པ་དང་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བའི་ལྷ་རྣམས་ལ་ཡང་གསོལ་བ་འདེབས་ཏེ
en: They desired a son, so the householder supplicated the deities. He prayed to Paśupati, Varuṇa, Kubera, Śakra, Brahmā, and the rest, and to the deities of the pleasure groves, the forest deities, the deities of the crossroads, the deities of forks in the road, the deities who receive strewn oblations, the deities of his inherited tradition, and the deities who are in constant attendance of righteous persons.

source: དེ་དེ་ལྟར་གསོལ་བ་འདེབས་པ་ལྷུར་ལེན་དུ་ཟིན་ཀྱང་བུ་ཡང་མ་བྱུང་བུ་མོ་ཡང་མ་བྱུང་ངོ་། །
en: Although he made every effort to pray to them, he still could not have a son or a daughter.

source: དེར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྐུ་བལྟམ་པ་དེའི་ཚེ། མཚན་མཁན་རྣམས་ཀྱིས་ལུང་བསྟན་པ།
en: Then, when the Bodhisattva was born, the soothsayers prophesied,

source: གལ་ཏེ་ཁྱིམ་ན་གནས་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: “If he remains here at home, he will become a universal monarch,

source: གལ་ཏེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ། ཆོས་གོས་ཚོན་ཅན་དག་བགོས་ནས་ཡང་དག་པའི་དད་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ནི་འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གྲགས་པ་དང་ལྡན་པར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ནས་ཚིག་དེ་ཁ་ལོ་བ་རབ་བཟང་གིས་ཐོས་ནས
en: but if he shaves his head and face and dons the colorful religious robes, and if with nothing short of perfect faith he goes forth from home to live as a mendicant, then he will be renowned throughout the world as a tathāgata, an arhat, a totally and completely awakened buddha.”

source: ཐོས་མ་ཐག་ཏུ་དེ་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེས་ཏེ།
en: Upon hearing these words, the charioteer Subhadra was devastated.

source: གལ་ཏེ་བདག་གི་བུ་ཞིག་ཡོད་ན་ནི་དེ་གཞོན་ནུའི་ཁ་ལོ་པར་འགྱུར་ཏེ། དེ་ལྟ་ན་ཁ་ལོ་པ་རབས་ཆད་པར་མི་འགྱུར་ཞིག་གུ་སྙམ་དུ་བསམས་ནས།
en: “If I have a son,” he thought, “he will become charioteer to the prince, and our lineage of charioteers will not be broken.”

source: ལྷག་པར་ཡང་ལྷ་སོ་སོ་ལ་གསོལ་བ་འདེབས་པ་ལ་ཞུགས་སོ། །
en: With that, he began making especially fervent prayers to all the deities.

source: དེའི་ཚེ་དེར་བྱང་ཆུབ་སེམས་དཔས་རྒན་པོ་དང་ནད་པ་དང་ཤི་བ་མཐོང་ནས་ནགས་ཀྱི་ནང་དུ་གནས་བཅས་ཏེ། དེ་དེར་སོང་ནས་ལོ་དྲུག་གི་བར་དུ་དཀའ་བ་སྤྱད་དེ།
en: The Bodhisattva, upon witnessing old age, sickness, and death, went to live in the forest, where he practiced austerities for six years.
